Infineon/mbedtls-optiga-trust-m/example_tls_client_xmc/xmc4800_iot_kit/common/aws_tcp_echo_client_single_task.c
/*
 * PEM-encoded server certificate
 *
 * Must include the PEM header and footer:
 * "-----BEGIN CERTIFICATE-----\n"\
 * "...base64 data...\n"\
 * "-----END CERTIFICATE-----\n"
 */
#if ( configTCP_ECHO_TASKS_SINGLE_TASK_TLS_ENABLED == 1 )


static const char cTlsECHO_SERVER_CERTIFICATE_PEM[] =
"-----BEGIN CERTIFICATE-----\n"
"MIIB6TCCAY4CEQCIiIiIiIiIiIiIiIiIiIiIMAoGCCqGSM49BAMCMHgxCzAJBgNV\n"
"BAYTAlNHMRIwEAYDVQQIDAlTaW5nYXBvcmUxEjAQBgNVBAcMCVNpbmdhcG9yZTEe\n"
"MBwGA1UECgwVSW5maW5lb24gVGVjaG5vbG9naWVzMQwwCgYDVQQLDANEU1MxEzAR\n"
"BgNVBAMMClRMU19TZXJ2ZXIwHhcNMTkwNzE1MDIzNTI0WhcNMjkwNzEyMDIzNTI0\n"
"WjB4MQswCQYDVQQGEwJTRzESMBAGA1UECAwJU2luZ2Fwb3JlMRIwEAYDVQQHDAlT\n"
"aW5nYXBvcmUxHjAcBgNVBAoMFUluZmluZW9uIFRlY2hub2xvZ2llczEMMAoGA1UE\n"
"CwwDRFNTMRMwEQYDVQQDDApUTFNfU2VydmVyMFkwEwYHKoZIzj0CAQYIKoZIzj0D\n"
"AQcDQgAE0jLl4KdE8eJGdV9RzI9+kzkUIt5dZq8JyOLhzxyOCMLo0GZ6zDs8nkno\n"
"Gmt1RX7aj7nqp0/rfODnFdZQVPEwnTAKBggqhkjOPQQDAgNJADBGAiEAucb4OgdZ\n"
"ubMiQwCiKkOTJKxir4ZUoRbP/Bb40YQ13FYCIQCx/Y5VPNyeL+P+IcQH+g2Dkc5p\n"
"30ByOlKA2QXAfzUYoA==\n"
"-----END CERTIFICATE-----\n";

    static const uint32_t ulTlsECHO_SERVER_CERTIFICATE_LENGTH = sizeof( cTlsECHO_SERVER_CERTIFICATE_PEM );
#endif

/*-----------------------------------------------------------*/

/*
 * Uses a socket to send data to, then receive data from, the standard echo
 * port number 7.
 */
static void prvEchoClientTask( void * pvParameters );

/*
 * Creates a pseudo random sized buffer of data to send to the echo server.
 */
static BaseType_t prvCreateTxData( char * ucBuffer,
                                   uint32_t ulBufferLength );

/*-----------------------------------------------------------*/

/* Rx and Tx time outs are used to ensure the sockets do not wait too long for
 * missing data. */
static const TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 2000 );
static const TickType_t xSendTimeOut = pdMS_TO_TICKS( 2000 );

/* Counters for each created task - for inspection only. */
static uint32_t ulTxRxCycles[ echoNUM_ECHO_CLIENTS ] = { 0 },
                ulTxRxFailures[ echoNUM_ECHO_CLIENTS ] = { 0 },
                ulConnections[ echoNUM_ECHO_CLIENTS ] = { 0 };

/* Rx and Tx buffers for each created task. */
static char cTxBuffers[ echoNUM_ECHO_CLIENTS ][ echoBUFFER_SIZES ],
            cRxBuffers[ echoNUM_ECHO_CLIENTS ][ echoBUFFER_SIZES ];

/*-----------------------------------------------------------*/

void vStartTCPEchoClientTasks_SingleTasks( void )
{
    BaseType_t xX;
    char cNameBuffer[ echoMAX_TASK_NAME_LENGTH ];

    /* Create the echo client tasks. */
    for( xX = 0; xX < echoNUM_ECHO_CLIENTS; xX++ )
    {
        snprintf( cNameBuffer, echoMAX_TASK_NAME_LENGTH, "Echo%ld", xX );
        xTaskCreate( prvEchoClientTask,                               /* The function that implements the task. */
                     cNameBuffer,                                     /* Just a text name for the task to aid debugging. */
                     democonfigTCP_ECHO_TASKS_SINGLE_TASK_STACK_SIZE, /* The stack size is defined in FreeRTOSIPConfig.h. */
                     ( void * ) xX,                                   /* The task parameter, not used in this case. */
                     //democonfigTCP_ECHO_TASKS_SINGLE_TASK_PRIORITY,   /* The priority assigned to the task is defined in FreeRTOSConfig.h. */
					 tskIDLE_PRIORITY,
                     NULL );                                          /* The task handle is not used. */
    }
}
/*-----------------------------------------------------------*/

//Test define macros
#define ENABLE_TRUSTM           1

#define READ_UID_TEST           0
int TRUSTM_UID_LOOP_COUNT =1;

#define AUTH_TEST               0
int TRUSTM_AUTH_LOOP_COUNT=1;

#define EXAMPLE_UNIT_TESTS      0
int TRUSTM_UNIT_TEST_LOOP_COUNT=1;

static void prvEchoClientTask( void * pvParameters )
{
    Socket_t xSocket;
/*_RB_ struct convention is for this not to be typedef'ed, so 'struct' is required. */ SocketsSockaddr_t xEchoServerAddress;
    int32_t lLoopCount = 0UL;
    const int32_t lMaxLoopCount = 100;
    volatile uint32_t ulTxCount = 0UL;
    BaseType_t xReceivedBytes, xReturned, xInstance;
    BaseType_t xTransmitted, xStringLength;
    char * pcTransmittedString;
    char * pcReceivedString;
    TickType_t xTimeOnEntering;
    const int CONNECT_COUNT = 1;

#if (SHOW_ECHO_TASK_PATH == 1)
	configPRINTF( ( ">prvEchoClientTask()\r\n") );
#endif

    #if ( ipconfigUSE_TCP_WIN == 1 )
        {
            WinProperties_t xWinProps;

            /* Fill in the buffer and window sizes that will be used by the socket. */
            xWinProps.lTxBufSize = ipconfigTCP_TX_BUFFER_LENGTH;
            xWinProps.lTxWinSize = configECHO_CLIENT_TX_WINDOW_SIZE;
            xWinProps.lRxBufSize = ipconfigTCP_RX_BUFFER_LENGTH;
            xWinProps.lRxWinSize = configECHO_CLIENT_RX_WINDOW_SIZE;
        }
    #endif /* ipconfigUSE_TCP_WIN */

    /* This task can be created a number of times.  Each instance is numbered
     * to enable each instance to use a different Rx and Tx buffer.  The number is
     * passed in as the task's parameter. */
    xInstance = ( BaseType_t ) pvParameters;

    /* Point to the buffers to be used by this instance of this task. */
    pcTransmittedString = &( cTxBuffers[ xInstance ][ 0 ] );
    pcReceivedString = &( cRxBuffers[ xInstance ][ 0 ] );

#if defined(TLS_SECRET_IN_TRUSTM)
#if ( ENABLE_TRUSTM == 1 )
	optiga_lib_status_t open_app_status = trustm_OpenApp();
	if (open_app_status != OPTIGA_LIB_SUCCESS)
	{
		configPRINTF( ( "TCPCLient(): Error: Open TrustM App failed. status=0x%x\r\n",open_app_status) );
		goto cleanup;
	}else
	{
		configPRINTF( ( "TCPCLient(): Open TrustM App Ok\r\n") );
	}

#if ( READ_UID_TEST == 1 )
	do{
		configPRINTF( ( "+++++Read UID Test:+++++\r\n") );
		example_optiga_util_read_uid();
		configPRINTF( ( "Read UID done count=%d\r\n",TRUSTM_UID_LOOP_COUNT-- ) );
	}while(TRUSTM_UID_LOOP_COUNT);
	configPRINTF( ( "+++++Read UID Test Completed+++++\r\n") );
#endif

#if ( AUTH_TEST == 1 )
	do{
		configPRINTF( ( "+++++Authentication Test+++++\r\n") );
		example_authenticate_chip();
		configPRINTF( ( "Auth done count=%d\r\n",TRUSTM_AUTH_LOOP_COUNT-- ) );
	}while(TRUSTM_AUTH_LOOP_COUNT);
	configPRINTF( ( "+++++Auth Test Completed+++++\r\n") );
#endif

#if (EXAMPLE_UNIT_TESTS==1)
	    do
	    {
	    	configPRINTF( ( "+++++Unit Tests+++++\r\n") );
			example_optiga_crypt_ecc_generate_keypair();
			example_optiga_crypt_ecdsa_sign();
			example_optiga_crypt_ecdsa_verify();
			example_optiga_crypt_hash();
			example_optiga_crypt_random();

			example_optiga_crypt_rsa_encrypt_message();

			example_optiga_crypt_rsa_generate_keypair();
			example_optiga_crypt_rsa_sign();
			example_optiga_crypt_rsa_verify();
			example_optiga_util_protected_update();
			example_optiga_util_read_data();
			example_optiga_util_update_count();
			example_optiga_util_write_data();
			example_optiga_crypt_tls_prf_sha256();
			example_optiga_crypt_ecdh();
			example_optiga_crypt_rsa_encrypt_session();
			example_optiga_crypt_rsa_decrypt_and_export();

			configPRINTF( ( "Example unit tests loop count=%d\r\n",TRUSTM_UNIT_TEST_LOOP_COUNT--) );
	    }while(TRUSTM_UNIT_TEST_LOOP_COUNT);
	    configPRINTF( ( "+++++Unit Tests Completed+++++\r\n") );
#endif
#endif
#endif


    /* Echo requests are sent to the echo server.  The address of the echo
     * server is configured by the constants configECHO_SERVER_ADDR0 to
     * configECHO_SERVER_ADDR3 in FreeRTOSConfig.h. */
    xEchoServerAddress.usPort = SOCKETS_htons( echoECHO_PORT );
    xEchoServerAddress.ulAddress = SOCKETS_inet_addr_quick( configECHO_SERVER_ADDR0,
                                                            configECHO_SERVER_ADDR1,
                                                            configECHO_SERVER_ADDR2,
                                                            configECHO_SERVER_ADDR3 );


    for( int i=0; i<CONNECT_COUNT;i++ )
    {
    	 configPRINTF( ( "================= TCP Client Connect count=%d ===================\r\n", i ) );

